{
  "backend/main.mo": "Defines the main actor with types for users, avatars, tasks, history entries, and comparison helpers, integrating blob storage and authorization mixins.",
  "feature_evidence.json": "Lists feature evidence entries describing frontend files, components, and test IDs involved in overtime-related registration updates.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files covering routing, dashboards, overtime features, components, and utilities.",
  "frontend/index.css": "Defines Tailwind CSS variables for light and dark themes using OKLCH color values and applies global background, text, and border styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app and containing a rebuild trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Timestamped file used to force frontend rebuilds with an incrementing build version.",
  "frontend/src/App.tsx": "Main app logic handling authentication, profile setup, role‑based routing, and profile refetching with an error boundary wrapper.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches rendering errors and shows a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Displays detailed assistant information including overtime totals, history, charts, task habits, export to CSV, and manager‑only actions.",
  "frontend/src/components/AssistantList.tsx": "Renders a scrollable list of assistants with avatars and overtime totals, showing skeletons while loading and allowing selection of an assistant.",
  "frontend/src/components/DangerZone.tsx": "Provides UI for wiping all stored data, including confirmation dialog logic and mutation handling with cache clearing and logout.",
  "frontend/src/components/Header.tsx": "Displays the app header with theme toggle, profile controls, avatar modal, and logout handling tied to Internet Identity and query cache.",
  "frontend/src/components/ManagerAnalytics.tsx": "Fetches overtime totals for assistants and displays summaries, progress bars, and a bar chart with loading states.",
  "frontend/src/components/OvertimeChart.tsx": "Builds a cumulative overtime chart (line or bar) from entries, showing loading skeletons and empty states as needed.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime with validation, submission handling, and UI for date, minutes, and optional comments.",
  "frontend/src/components/OvertimeHistory.tsx": "Displays paginated, searchable overtime entries with editing allowed only for the latest entry.",
  "frontend/src/components/OvertimeSummary.tsx": "Shows a summary card of total overtime days, hours, and minutes with loading skeletons.",
  "frontend/src/components/profile/AvatarModal.tsx": "Modal for uploading a profile picture or selecting a preset avatar, with validation and save actions.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar from a profile picture, preset image, or initials fallback.",
  "frontend/src/components/ProfileDialog.tsx": "Profile modal allowing users to view profile data and edit their initials.",
  "frontend/src/components/todo/AuditLogView.tsx": "Displays a searchable and filterable audit log of task actions with error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Dialog for viewing an enlarged evidence image associated with a task.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for submitting a task completion with optional comment and photo, handling file conversion and form reset.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Displays the user who completed a task, loading their profile and showing an avatar if available.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Component for selecting, capturing, previewing, and validating a task completion photo using file input or camera.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Dialog showing a task’s audit history with timestamps, actions, user info, and optional evidence photo previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "UI for selecting an assistant and viewing or updating their preference settings for all tasks.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main task management section handling task CRUD, marking tasks done with photos, searching, and periodic refresh.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders an interactive task table with frequency coloring, photo previews, history dialogs, and actions like edit, complete, and pin.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Provides a modal form for creating or editing tasks, including validation, frequency selection, and optional delete confirmation.",
  "frontend/src/constants/dentalPresets.ts": "Defines 24 static dental‑themed avatar presets and a helper to fetch a preset by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing authentication state, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, avatars, tasks, and related backend data using the actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark/system theme preference with persistence and automatic system theme syncing.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables for colors, layout, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders assistant dashboard with tabs for to‑do tasks and overtime logging, summary, charts, and history.",
  "frontend/src/pages/LoginPage.tsx": "Displays login screen using Internet Identity with branding, card UI, and loading state.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides manager dashboard with tabs for tasks, team management, analytics, audit logs, and settings.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Contains profile setup form for username, initials, language, and initial overtime with validation and submission.",
  "frontend/src/utils/externalBlobUrl.ts": "Resolves an ExternalBlob to a usable URL, preferring direct URLs and falling back to object URLs.",
  "frontend/src/utils/overtimeDates.ts": "Utility functions for formatting overtime dates, getting today's local date, and detecting future dates.",
  "frontend/src/utils/overtimeStyles.ts": "Returns CSS classes for overtime cells based on whether overtime is added or used.",
  "frontend/src/utils/photoValidation.ts": "Validates image uploads, enforcing JPEG/PNG type and a 6MB size limit.",
  "frontend/src/utils/presetTileColors.ts": "Provides deterministic accent color sets for avatar tiles based on preset ID using a predefined OKLCH palette.",
  "frontend/src/utils/taskHabits.ts": "Calculates on‑time task metrics, formats completion history, and maps task preferences to labels and colors.",
  "frontend/src/utils/todoDates.ts": "Computes next due dates and urgency scores for tasks based on frequency and provides related date formatting utilities.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage support and hash‑routing compatibility.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, animations, and enabling plugins for UI styling.",
  "project_state.json": "JSON file describing the project’s state, existing features, and pending requests related to a manager‑access rule."
}