{
  "backend/main.mo": "Defines core data types and comparison helpers for users, tasks, audit logs, and overtime entries within the backend actor.",
  "feature_evidence.json": "Lists feature evidence records with associated files, components, tests, and metadata for dark mode and language‑default updates.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend files including pages, components, hooks, utilities, and styling.",
  "frontend/index.css": "Sets global Tailwind layers and OKLCH color variables for light and dark themes including layout tokens.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads the main TypeScript entrypoint.",
  "frontend/public/rebuild-trigger.txt": "Timestamp marker used to force rebuilds and track build version.",
  "frontend/src/App.tsx": "Root application component handling authentication, profile setup, role-based routing, and theme provider wrapping.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload option on uncaught errors.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager-only detail view showing an assistant’s overtime data, charts, CSV export, and task habit metrics.",
  "frontend/src/components/AssistantList.tsx": "Displays a scrollable list of assistants with selection handling and shows each assistant’s overtime totals fetched via a query.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with branding, user info, theme toggle, and logout action.",
  "frontend/src/components/ManagerAnalytics.tsx": "Computes overtime totals for assistants and renders summary rows and bar charts for team-wide analytics.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a cumulative overtime trend chart (line or bar) by transforming overtime entries into date‑grouped chart data.",
  "frontend/src/components/OvertimeForm.tsx": "Provides a form to submit overtime additions or deductions with validation and date formatting before sending to the backend.",
  "frontend/src/components/OvertimeHistory.tsx": "Shows a searchable, paginated overtime entry table with formatted dates and minute breakdowns.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays overtime totals with loading skeletons and formatted days, hours, and minutes.",
  "frontend/src/components/ThemeProvider.tsx": "Wraps NextThemesProvider to supply theme context to the app.",
  "frontend/src/components/todo/AuditLogView.tsx": "Renders a searchable and filterable audit log of task actions with error handling and sorting.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Shows a dialog displaying a full-size preview of an evidence image for a task.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Provides a dialog for marking tasks done with optional comments and image uploads including validation and preview.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Displays a task’s action history in a dialog with timestamps and optional evidence image previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Allows selecting an assistant and viewing or updating their task preferences with icons and mutation handling.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main to-do section component handling task CRUD, filtering, sorting, dialogs, and query mutations.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders a task table with urgency indicators, actions, and history/image previews.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Dialog for creating or editing tasks with validation and optional delete confirmation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor tied to Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, loading stored identities, and exposing authentication methods.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for profiles, overtime, assistants, and to-do task operations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context before rendering App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to‑dos and overtime, fetching and logging overtime entries.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen using Internet Identity with branding and a sign‑in button.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides manager views for to‑dos, team management, analytics, and audit logs with assistant data controls.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Allows new assistants to set a username and language, submitting registration via mutation.",
  "frontend/src/utils/overtimeStyles.ts": "Exports a helper that returns a CSS class based on whether overtime is added or used.",
  "frontend/src/utils/taskHabits.ts": "Provides utilities for task completion metrics, formatting history, timestamps, and preference labels/colors.",
  "frontend/src/utils/todoDates.ts": "Provides helper functions for computing next due dates, urgency scores, and display labels for recurring tasks using workday-based rules and Monday-based rollovers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash routing), persisting them in sessionStorage, and removing them from the URL without reload.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom colors, animations, and plugin setup for typography, container queries, and animation.",
  "project_state.json": "Captures the app’s current project state, requirements, architectural notes, known issues, and feature definitions for planning and migration tracking."
}