{
  "backend/main.mo": "Defines the backend actor with storage mixins plus data types for users, tasks, audit logs, avatars, and comparison helpers for sorting tasks and history.",
  "backend/migration.mo": "Provides a no-op migration function returning an empty state.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH-based light/dark theme variables and base styles.",
  "frontend/index.html": "Main HTML entry point loading the React app and including a rebuild trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Stores the rebuild timestamp and build version number.",
  "frontend/src/App.tsx": "Root React component controlling authentication flow, profile setup, and role‑based dashboard routing.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that captures rendering errors and shows a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager view showing a selected assistant’s overtime totals, history, CSV export, and task habit metrics.",
  "frontend/src/components/AssistantList.tsx": "Scrollable assistant list displaying avatars and overtime totals with selection support.",
  "frontend/src/components/Header.tsx": "Header with logo, theme toggle, user avatar/profile controls, and logout handling using Internet Identity and dialogs.",
  "frontend/src/components/ManagerAnalytics.tsx": "Manager dashboard rendering assistant overtime summaries and a team bar chart using fetched totals.",
  "frontend/src/components/OvertimeChart.tsx": "Displays cumulative overtime over time as a line or bar chart, with loading and empty states.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime entries with validation, submission handling, and toast feedback.",
  "frontend/src/components/OvertimeHistory.tsx": "Paginated, searchable overtime history table with editing enabled only for the latest entry.",
  "frontend/src/components/OvertimeSummary.tsx": "Card showing total overtime balance broken into days, hours, and minutes with loading fallback.",
  "frontend/src/components/profile/AvatarModal.tsx": "Provides a modal for uploading a custom profile picture or selecting from preset avatars, handling validation and saving updates.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar using a profile picture, preset asset, or fallback initials/icon, loading external blob URLs when needed.",
  "frontend/src/components/ProfileDialog.tsx": "Displays a dialog for viewing and editing a user's profile, including avatar, role, and initials with save functionality.",
  "frontend/src/components/todo/AuditLogView.tsx": "Shows a searchable, filterable audit log of task actions with timestamps, task lookup, and error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Displays a dialog with a large preview of an evidence image for a task, with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task complete, allowing comment entry and optional photo upload before submitting.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Displays attribution for task completion, showing the completer's avatar and name or initials.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Component for selecting or capturing a task completion photo, handling validation, camera use, previews, and removal.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Dialog showing a task’s audit history with timestamps, actions, and optional evidence photo previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Interface for viewing and updating each assistant’s task preferences, with selectable assistants and preference editing.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main task management section that lists tasks, supports search, and handles creating, editing, deleting, and marking tasks done.",
  "frontend/src/components/todo/ToDoTable.tsx": "Table listing tasks with urgency indicators, actions, pinning, and evidence photo/history previews.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "React dialog component for creating, editing, validating, and deleting to‑do tasks with form state and frequency handling.",
  "frontend/src/constants/dentalPresets.ts": "Exports a list of 24 dental‑themed preset avatar definitions and a helper to fetch one by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, avatars, tasks, and related mutations using the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark/system theme selection, persistence, and system preference syncing.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and extensive light/dark theme color variables for the app’s UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders assistant dashboard with tabs for to‑dos and overtime, fetching user overtime data and handling overtime logging.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login UI with branding and a sign‑in button showing loading states.",
  "frontend/src/pages/ManagerDashboard.tsx": "Displays manager dashboard with tabs for to‑dos, team management, analytics, and audit logs, supporting assistant selection and deletion.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Form for new users to set username, initials, and language, registering their profile via backend mutation.",
  "frontend/src/utils/externalBlobUrl.ts": "Generates a usable URL for an ExternalBlob by preferring direct URLs or falling back to creating an object URL from bytes.",
  "frontend/src/utils/overtimeDates.ts": "Utility functions for formatting overtime dates, getting today's local date, and checking if a date is in the future.",
  "frontend/src/utils/overtimeStyles.ts": "Returns a CSS class name for overtime cells based on whether time was added or used.",
  "frontend/src/utils/photoValidation.ts": "Validates uploaded images by checking MIME type and enforcing a 6MB size limit.",
  "frontend/src/utils/presetTileColors.ts": "Provides deterministic accent color sets for avatar tiles based on a preset ID.",
  "frontend/src/utils/taskHabits.ts": "Utilities for computing on‑time task metrics, formatting completion history, and labeling or coloring task preferences.",
  "frontend/src/utils/todoDates.ts": "Provides date utilities for task frequencies, computing next due dates, urgency scores, and formatting due messages.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and sessionStorage parameters for routing and state retention.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes project state and requirements for resetting user profiles and auto-assigning the first post-reset user as manager."
}