{
  "backend/main.mo": "Defines core types for users, tasks, task history, audit logs, and comparison utilities, and includes blob storage mixin logic.",
  "feature_evidence.json": "Contains a feature evidence report describing a requirement to double a header logo size and its related files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files covering routing, dashboards, UI components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH colors with light and dark mode variables and global style rules.",
  "frontend/index.html": "Base HTML document for mounting the React app with a rebuild trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Stores a timestamp and build version used to trigger frontend rebuilds.",
  "frontend/src/App.tsx": "Main app controller handling authentication, profile setup flow, and routing to assistant or manager dashboards with an error boundary wrapper.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary component that catches runtime errors and shows a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Displays detailed assistant info including overtime stats, CSV export, task habits, charts, and history table with manager actions.",
  "frontend/src/components/AssistantList.tsx": "Renders a scrollable list of assistants using avatars and overtime totals with selection handling.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user profile controls, avatar modals, and logout handling.",
  "frontend/src/components/ManagerAnalytics.tsx": "Builds overtime analytics for assistants, including bar charts and summary rows using fetched totals.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a cumulative overtime trend chart from entries, supporting line or bar variants with loading and empty states.",
  "frontend/src/components/OvertimeForm.tsx": "Provides a form to add or use overtime with validation, submission handling, and UI feedback.",
  "frontend/src/components/OvertimeHistory.tsx": "Displays searchable, paginated overtime history with support for editing the latest entry.",
  "frontend/src/components/OvertimeSummary.tsx": "Shows a summary card of total overtime days, hours, and minutes with loading placeholders.",
  "frontend/src/components/profile/AvatarModal.tsx": "Modal for changing a user's avatar via image upload or selecting from preset avatars, saving updates through backend mutations.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user's avatar using a profile picture, preset image, or fallback initials/icon with dynamic sizing.",
  "frontend/src/components/ProfileDialog.tsx": "Displays and edits user profile data including avatar, username, role, and editable initials with save validation.",
  "frontend/src/components/todo/AuditLogView.tsx": "Shows a searchable and filterable audit log of task actions, pulling task titles and formatting timestamps.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Dialog displaying a full-size preview of a task evidence image with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for completing a task, allowing optional comment and photo upload before submitting completion data.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Displays the user who completed a task, showing their avatar and name or initials.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Handles file or camera-based photo capture, validates images, and returns selected photo data and preview URLs.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Displays a task’s audit history with timestamps, actions, and optional evidence photo previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Lets admins view and update assistants’ task preferences with selectable assistants and inline preference editing.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main task management section handling task CRUD, marking tasks done, pin toggling, filtering, and auto-refresh.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders the task list with urgency indicators, action buttons, image previews, and access to task history.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "React dialog for creating, editing, validating, and deleting to-do tasks with frequency selection.",
  "frontend/src/constants/dentalPresets.ts": "Defines 24 dental-themed preset avatar objects and a helper to fetch one by ID.",
  "frontend/src/hooks/useActor.ts": "Initializes and provides a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and stored identity loading via React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, avatars, and tasks through the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light, dark, and system theme selection with persistence and automatic system preference handling.",
  "frontend/src/index.css": "Tailwind base styles plus extensive light/dark theme CSS variables for colors and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to‑dos and overtime tracking, including forms, summaries, and charts.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen and triggers Internet Identity authentication.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides manager views for team management, analytics, audit logs, and to‑do tools with assistant selection and deletion handling.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Collects username, initials, and language to create a new assistant profile with validation and registration.",
  "frontend/src/utils/externalBlobUrl.ts": "Generates a usable URL for an external blob, preferring direct URLs and falling back to object URLs.",
  "frontend/src/utils/overtimeDates.ts": "Utility functions for formatting overtime dates, getting today's date, and checking for future dates.",
  "frontend/src/utils/overtimeStyles.ts": "Returns CSS classes for overtime entry cells based on whether time was added or used.",
  "frontend/src/utils/photoValidation.ts": "Validates photo uploads for allowed types and maximum file size.",
  "frontend/src/utils/presetTileColors.ts": "Provides deterministic color schemes for avatar preset tiles based on preset ID.",
  "frontend/src/utils/taskHabits.ts": "Computes task completion metrics, formats completion history, and provides helpers for timestamps and preference labels/colors.",
  "frontend/src/utils/todoDates.ts": "Provides helpers for mapping task frequencies to labels and computing next due dates, formatted due strings, and urgency scores using workday logic.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind setup extending theme colors, radii, animations, and shadows, and enabling dark mode and plugins.",
  "project_state.json": "JSON describing the project’s state, goals, feature requests, and deployment intentions for the Internet Computer."
}