{
  "backend/main.mo": "Defines core types for users, tasks, audit logs, and overtime entries along with comparison helpers for sorting.",
  "feature_evidence.json": "Feature evidence record linking a rebuild-trigger feature to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains pre-generated concise summaries for various frontend source files.",
  "frontend/index.css": "Sets Tailwind base layers and OKLCH color variables for light and dark themes, including chart and UI colors.",
  "frontend/index.html": "HTML entry point loading the React app with a build-trigger timestamp comment.",
  "frontend/public/rebuild-trigger.txt": "Marker file indicating a forced rebuild with a timestamp and build version.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, and role‑based routing inside an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager-only detail view showing an assistant’s overtime totals, history, CSV export, and task habit metrics.",
  "frontend/src/components/AssistantList.tsx": "Scrollable assistant list showing overtime summaries and allowing selection for detailed viewing.",
  "frontend/src/components/Header.tsx": "Renders the app header with logo, username, theme toggle, and logout button.",
  "frontend/src/components/ManagerAnalytics.tsx": "Displays overtime analytics for assistants using bar charts and summary components, fetching totals per assistant.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a line or bar chart showing cumulative overtime over time with loading and empty states.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime, including date validation, minute input, comments, and submission handling.",
  "frontend/src/components/OvertimeHistory.tsx": "Shows searchable, paginated overtime entries with formatted dates, types, comments, and loading skeletons.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays total overtime in days, hours, and minutes with a summary card and loading state.",
  "frontend/src/components/todo/AuditLogView.tsx": "Displays and filters the full audit log with search, action filtering, and error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Shows a modal dialog with a large preview of an evidence image for a task.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for completing a task with optional comment and image upload, including validation and preview.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Modal showing a task's full history with actions, timestamps, and optional evidence image preview.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Manages assistants' task preference settings with selection, display, and updates of per-task preferences.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main task list UI enabling creation, editing, filtering, marking done, pinning, and deleting tasks.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders a task table with frequency‑based styling, image previews, and action buttons for editing, marking done, and pinning tasks.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Provides a dialog for creating or editing tasks, handling form state, validation, and optional task deletion.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, overtime tracking, assistant management, and to‑do task operations via the actor.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines light/dark theme CSS variables, including color tokens for tasks and overtime.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to‑do tasks and overtime logging, fetching entries and totals and allowing overtime submission and logout.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen with Internet Identity authentication and a branded welcome layout.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides the manager dashboard with tabs for tasks, team management, analytics, and audit logs, including assistant selection and deletion workflows.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Shows a profile setup form where new assistants choose a username and language and submit registration.",
  "frontend/src/utils/overtimeStyles.ts": "Exports a helper that returns CSS classes for overtime cells based on whether time was added or used.",
  "frontend/src/utils/taskHabits.ts": "Contains utilities for computing on‑time metrics, formatting completion history, timestamps, and task preference labels and colors.",
  "frontend/src/utils/todoDates.ts": "Provides functions to compute next due dates, labels, and urgency scores for tasks based on frequency and completion times.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from either session or the hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS settings including dark mode, content paths, extended theme colors, animations, and plugins.",
  "project_state.json": "Tracks the app's high-level project state, including versioning, feature summaries, architecture notes, and known issues."
}