{
  "backend/main.mo": "Defines the actor with storage mixin and types for users, avatars, tasks, audit logs, and comparison utilities.",
  "backend/migration.mo": "Contains a no-op migration function returning an empty new state.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Provides human-written summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base/theme CSS defining light and dark OKLCH color variables and global styles.",
  "frontend/index.html": "HTML entry point loading the React app and including a rebuild trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Plain text file containing the rebuild timestamp and build version.",
  "frontend/src/App.tsx": "Root component handling authentication, profile fetch logic, and routing to login, setup, or dashboards.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload button on unhandled errors.",
  "frontend/src/components/AssistantDetailView.tsx": "Assistant detail view showing overtime data, task habits, CSV export, and profile info with manager controls.",
  "frontend/src/components/AssistantList.tsx": "Displays a scrollable list of assistants with avatars and overtime totals, allowing selection and handling loading states.",
  "frontend/src/components/DangerZone.tsx": "Provides UI to confirm and execute a full data wipe, clearing storage, cache, and logging the user out.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user avatar/profile controls, and logout functionality.",
  "frontend/src/components/ManagerAnalytics.tsx": "Aggregates and visualizes assistants' overtime totals with summary rows and bar charts, handling loading per assistant.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a cumulative overtime chart (line or bar) from entries, with loading and empty states.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime with validation, date handling, and success/error feedback.",
  "frontend/src/components/OvertimeHistory.tsx": "Displays searchable, paginated overtime entries and allows editing only the latest entry with validation and mutation support.",
  "frontend/src/components/OvertimeSummary.tsx": "Shows a card summarizing total overtime in days, hours, and minutes with loading skeletons.",
  "frontend/src/components/profile/AvatarModal.tsx": "Provides an avatar selection modal supporting profile picture upload, validation, preset selection, and profile saving.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Displays a user avatar prioritizing uploaded images, preset avatars, or initials with dynamic sizing.",
  "frontend/src/components/ProfileDialog.tsx": "Renders a user profile dialog with avatar, role, and editable initials saved through profile mutations.",
  "frontend/src/components/todo/AuditLogView.tsx": "Shows a searchable, filterable audit log of task actions with formatted timestamps and error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Displays a dialog to preview an evidence image for a task with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task complete with optional comment and photo upload, handling submission and form reset.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Displays the user who completed a task using profile data or fallback username with optional avatar.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Handles selecting, capturing, previewing, validating, and removing a photo for task completion evidence.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Shows a task’s audit history with timestamps, user info, action badges, and optional evidence photo preview.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Admin UI for viewing and updating assistants’ task preferences, including preferred, neutral, and hated states.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main to‑do section managing task CRUD, completion, pinning, searching, dialog state, and periodic refresh.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders a task table with frequency coloring, action buttons, image previews, and task history dialogs.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Modal dialog for creating or editing a task with validation and optional delete confirmation.",
  "frontend/src/constants/dentalPresets.ts": "Defines 24 static dental-themed avatar presets and a helper to fetch preset info by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity, and auth-client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, avatars, tasks, and related backend actions using the actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark/system theme selection with persistence and system preference syncing.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for a themed light/dark UI, including colors for UI, charts, tasks, and overtime.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to‑do tasks and overtime logging, summaries, charts, and history.",
  "frontend/src/pages/LoginPage.tsx": "Provides the login screen using Internet Identity with branding, status handling, and UI components.",
  "frontend/src/pages/ManagerDashboard.tsx": "Displays manager tools including team management, analytics, audit logs, to‑dos, and settings with assistant deletion support.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Handles new‑user profile creation with username, initials, language, validation, and submission to the backend.",
  "frontend/src/utils/externalBlobUrl.ts": "Creates a URL for external blobs, preferring direct URLs and falling back to object URLs from bytes.",
  "frontend/src/utils/overtimeDates.ts": "Provides date utilities for formatting, getting today’s local date, and checking for future dates.",
  "frontend/src/utils/overtimeStyles.ts": "Returns CSS class names for overtime cells based on add vs. use entries.",
  "frontend/src/utils/photoValidation.ts": "Validates uploaded images for type and size limits (JPEG/PNG, max 6MB).",
  "frontend/src/utils/presetTileColors.ts": "Provides deterministic accent colors for avatar preset tiles by mapping preset IDs to a fixed OKLCH color palette.",
  "frontend/src/utils/taskHabits.ts": "Computes on‑time task metrics, formats completion history, and provides display labels and colors for task preferences.",
  "frontend/src/utils/todoDates.ts": "Generates due dates and urgency scores for tasks based on frequency and workday rules, and formats due‑date text.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, animations, and loading plugins for the frontend theme.",
  "project_state.json": "Project state file describing current issues, features, and pending requests related to fixing the user profile setup flow."
}