{
  "backend/main.mo": "Defines user profiles, tasks, task history, audit logs, overtime entries, and comparison utilities for sorting entries.",
  "feature_evidence.json": "Lists features, related files, components, tests, and confidence levels for deployment evidence tracking.",
  "frontend-file-summaries.txt": "Provides short functional summaries for all key frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Defines global Tailwind-based theme variables for light and dark modes including color tokens and layout defaults.",
  "frontend/index.html": "Root HTML file bootstrapping the React app and including a build timestamp trigger.",
  "frontend/public/rebuild-trigger.txt": "Build metadata file used to force rebuilds with timestamp and version marker.",
  "frontend/src/App.tsx": "Main React app managing authentication, theme normalization, profile setup, and dashboard routing with an error boundary wrapper.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that catches rendering errors and shows a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager-only assistant detail panel showing overtime data, CSV export, task habit metrics, and completion history.",
  "frontend/src/components/AssistantList.tsx": "Renders a scrollable list of assistants with overtime totals, handling loading and empty states. Includes selectable assistant cards with overtime summaries fetched per assistant.",
  "frontend/src/components/Header.tsx": "Displays the app header with logo, username, theme toggle, and logout button. Uses theme switching and a dropdown menu for theme options.",
  "frontend/src/components/ManagerAnalytics.tsx": "Aggregates overtime totals for assistants and displays summary rows, progress bars, and a team bar chart. Fetches overtime data per assistant and handles loading states.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a cumulative overtime trend chart (line or bar) from overtime entries with date formatting. Handles loading and empty states using card layouts.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime with validation for date and minutes, then submits parsed data to the backend. Provides toast notifications and resets form on success.",
  "frontend/src/components/OvertimeHistory.tsx": "Displays paginated, searchable overtime entry history with formatted dates and time breakdowns. Supports loading skeletons and shows entry type indicators.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays overtime totals with days, hours, and minutes, showing skeleton loaders while data is loading. Uses cards and icons to present accumulated overtime details.",
  "frontend/src/components/todo/AuditLogView.tsx": "Renders a searchable and filterable audit log of task actions with badges, timestamps, and error handling. Pulls audit log and task data, then filters, sorts, and displays entries in a table.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Shows a modal dialog displaying a full-size preview of an evidence image for a task. Allows closing via a header button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task as completed, supporting optional comments and image upload with validation and preview. Submits base64-encoded image data and comment to a callback.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Displays a task’s full action history in a modal with timestamps, users, actions, and optional evidence previews. Fetches history data and shows loading, empty, or table states accordingly.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Manages assistants’ task preferences, allowing selection of an assistant and updating preference states per task. Fetches assistants, tasks, and preferences, displaying them in a table with icons and mutation support.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main to‑do section component handling task creation, updates, deletion, completion, filtering, and sorting via React state and query hooks.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders a task table with urgency indicators, actions, and history/image dialogs, formatting task timestamps and frequencies.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Dialog for creating or editing a task with validation, frequency selection, and optional delete confirmation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/clear actions, and initializes/stores identities using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for profiles, overtime, assistants, tasks, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and overtime-related colors.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Assistant dashboard showing to-do tasks, overtime logging, summaries, charts, and history with tab navigation.",
  "frontend/src/pages/LoginPage.tsx": "Login screen allowing users to authenticate via Internet Identity with a styled card UI.",
  "frontend/src/pages/ManagerDashboard.tsx": "Manager dashboard providing team management, analytics, audit logs, and to-do tools with tabbed navigation.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile setup form for registering username and language with validation and submission handling.",
  "frontend/src/utils/overtimeStyles.ts": "Utility returning CSS class names for overtime cell styling based on add/use type.",
  "frontend/src/utils/taskHabits.ts": "Helpers for computing on-time metrics, formatting task completion history, timestamps, and preference labels/colors.",
  "frontend/src/utils/todoDates.ts": "Provides utilities for labeling task frequencies, computing next due dates based on daily/weekly/monthly rules, formatting due date text, and calculating urgency scores.",
  "frontend/src/utils/urlParams.ts": "Handles reading URL parameters, persisting them in sessionStorage, and removing parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, current version state, architectural notes, and existing feature requirements for deployment behavior and theme defaults."
}