{
  "backend/main.mo": "Defines core actor types and logic for users, tasks, avatars, audit logs, overtime entries, and sorting utilities, using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report linking a specific onboarding-copy update to the affected frontend file and component versions.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their responsibilities such as routing, dashboards, forms, utilities, and styling.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark modes and applying base background and text rules.",
  "frontend/index.html": "Root HTML file that mounts the React app and includes a rebuild trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Timestamped marker file indicating current build version and rebuild time.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup flow, role‑based dashboard routing, and error boundary wrapping.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager‑side detailed assistant view showing overtime data, charts, task habits, and CSV export functionality.",
  "frontend/src/components/AssistantList.tsx": "Displays a selectable scrollable list of assistants with avatars and overtime totals, handling loading and empty states.",
  "frontend/src/components/DangerZone.tsx": "Provides a UI section for wiping all stored data, including a confirmation dialog and mutation to clear storage and reset the app.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user profile controls, avatar modal, and logout handling.",
  "frontend/src/components/ManagerAnalytics.tsx": "Displays overtime analytics for assistants, including summary rows and bar charts using fetched overtime totals.",
  "frontend/src/components/OvertimeChart.tsx": "Generates cumulative overtime charts (line or bar) by grouping and processing overtime entries.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime with validation, submission handling, and input reset logic.",
  "frontend/src/components/OvertimeHistory.tsx": "Shows paginated overtime history with search, formatting, and edit support for the latest entry.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays overtime totals with loading skeletons and shows days, hours, and minutes with UI cards and icons.",
  "frontend/src/components/profile/AvatarModal.tsx": "Modal for changing user avatars, supporting image upload and preset selection with validation and profile updates.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar from a profile picture, preset image, or initials, loading blob URLs when needed.",
  "frontend/src/components/ProfileDialog.tsx": "Profile dialog allowing users to view and edit their initials and see role and avatar info using profile queries.",
  "frontend/src/components/todo/AuditLogView.tsx": "Displays and filters the audit log of task actions with search, action filtering, and formatted timestamps.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Dialog that shows a large preview of an evidence image for a task with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task as done, supporting comments and optional photo upload before submission.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Shows who completed a task by displaying their avatar and initials or username.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Lets users upload or capture a photo for task completion, validating images and generating previews.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Displays a task’s audit history with timestamps, actions, and optional evidence photo previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Manages assistants’ task preferences, fetching data and allowing updates per task.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main to‑do section handling task CRUD, search, pinning, and marking tasks done.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders the task list with frequency indicators, actions, history access, and evidence photo previews.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "React dialog for creating, editing, and deleting to-do tasks with form validation and frequency selection.",
  "frontend/src/constants/dentalPresets.ts": "Defines 24 dental-themed preset avatars and a helper to fetch preset info by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, avatars, tasks, overtime, and related mutations using the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Hook for reading, applying, and toggling light, dark, or system theme with localStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS base file defining light and dark theme variables for a warm dental-themed UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to-do items and overtime management, including forms, summaries, history, and charts.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen using Internet Identity authentication with loading feedback and branding elements.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides manager views for tasks, team management, analytics, audit logs, and settings with assistant selection and deletion handling.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Shows a profile creation form for username, initials, and language, with validation and registration logic.",
  "frontend/src/utils/externalBlobUrl.ts": "Retrieves a usable URL for an ExternalBlob, preferring a direct URL and falling back to creating an object URL from bytes.",
  "frontend/src/utils/overtimeDates.ts": "Utility functions for formatting overtime dates, getting today's local date, and checking for future dates.",
  "frontend/src/utils/overtimeStyles.ts": "Returns a CSS class name indicating whether an overtime entry is an addition or usage.",
  "frontend/src/utils/photoValidation.ts": "Validates image files by checking allowed types and enforcing a 6MB size limit.",
  "frontend/src/utils/presetTileColors.ts": "Generates deterministic accent and hover colors for avatar tiles based on a preset ID.",
  "frontend/src/utils/taskHabits.ts": "Provides helpers for computing task completion metrics, formatting completion history, timestamps, and preference labels/colors.",
  "frontend/src/utils/todoDates.ts": "Provides utilities for computing task due dates, formatting due date text, and calculating urgency scores based on frequency and timing.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, animations, and loading Tailwind plugins.",
  "project_state.json": "Defines the project's state and pending feature requests focused on enforcing role defaults, making user 'Jay' a permanent Manager, and assigning new users as Assistants."
}