{
  "backend/main.mo": "Defines core types for users, tasks, avatars, audit logs, and history, plus comparison helpers, while including blob storage mixin.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference or documentation.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes with layout-wide CSS tokens.",
  "frontend/index.html": "HTML entrypoint loading the React app with a rebuild‑trigger comment.",
  "frontend/public/rebuild-trigger.txt": "Stores timestamp and build version used to trigger frontend rebuilds.",
  "frontend/src/App.tsx": "Main React app routing authentication, profile setup, and dashboard selection with defensive role checks and error boundary wrapper.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reload prompt.",
  "frontend/src/components/AssistantDetailView.tsx": "Manager view for a single assistant showing overtime totals, history, CSV export, and task habit metrics.",
  "frontend/src/components/AssistantList.tsx": "Scrollable assistant list displaying profile avatars and overtime totals with selection support.",
  "frontend/src/components/DangerZone.tsx": "Provides a UI for wiping all stored data with confirmation, triggering a mutation, clearing caches, logging out, and reloading the app.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user profile controls, avatar modal, and logout logic that clears identity and cache.",
  "frontend/src/components/ManagerAnalytics.tsx": "Displays managers’ analytics with overtime totals per assistant, summary rows, and a team overtime bar chart using fetched overtime data.",
  "frontend/src/components/OvertimeChart.tsx": "Generates a cumulative overtime trend chart (line or bar) by grouping and sorting entries, with loading and empty states.",
  "frontend/src/components/OvertimeForm.tsx": "Form for adding or using overtime with validation for minutes, date, and future dates, submitting via a callback.",
  "frontend/src/components/OvertimeHistory.tsx": "Shows paginated, searchable overtime history with minutes formatting and allows editing only the latest entry through a mutation.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays a card summarizing overtime totals with loading skeletons and breakdown by days, hours, and minutes.",
  "frontend/src/components/profile/AvatarModal.tsx": "Modal for changing avatars, allowing image upload with validation or choosing from preset avatars.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Renders a user avatar from a profile picture, preset image, or initials fallback with size options.",
  "frontend/src/components/ProfileDialog.tsx": "Profile dialog showing user info, avatar, role, and an editable initials field with validation and save handling.",
  "frontend/src/components/todo/AuditLogView.tsx": "Displays a searchable and filterable audit log of task actions with timestamps, action badges, and error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Dialog showing a full-size preview of an evidence photo for a task with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task done, allowing optional comment and photo upload before submission.",
  "frontend/src/components/todo/TaskCompletionAttribution.tsx": "Shows who completed a task using their profile avatar and initials or username.",
  "frontend/src/components/todo/TaskCompletionPhotoInput.tsx": "Provides UI for selecting or capturing a photo to attach to task completion, including validation and camera handling.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Displays a dialog showing a task's audit history with timestamps, actions, and evidence photo preview support.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Allows selecting an assistant and managing their task preference settings with update actions and visual indicators.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main task management section handling listing, searching, creating, editing, deleting, and marking tasks as done.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders the task list table with urgency indicators, actions, history viewing, and evidence photo preview functionality.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "React dialog for creating, editing, validating, and deleting to-do tasks with frequency selection and form state handling.",
  "frontend/src/constants/dentalPresets.ts": "Defines 24 dental-themed preset avatar metadata and a helper to retrieve preset info by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, avatars, tasks, and related backend data.",
  "frontend/src/hooks/useTheme.ts": "Hook for managing light, dark, and system themes with persistence and auto-updating based on system settings.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme colors for the dental UI design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AssistantDashboard.tsx": "Renders the assistant dashboard with tabs for to‑dos and overtime, pulling overtime data and allowing logging of hours.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen and triggers Internet Identity authentication with a styled UI.",
  "frontend/src/pages/ManagerDashboard.tsx": "Provides the manager dashboard with tabs for to‑dos, team management, analytics, audit logs, and settings, including assistant deletion.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Shows a profile setup form for new users to register username, initials, and language, then submits via registerAssistant.",
  "frontend/src/utils/externalBlobUrl.ts": "Generates a URL for an ExternalBlob using a direct link or a Blob fallback.",
  "frontend/src/utils/overtimeDates.ts": "Contains date utilities for formatting overtime dates, getting today's local date, and checking for future dates.",
  "frontend/src/utils/overtimeStyles.ts": "Returns a CSS class for overtime cells based on whether time was added or used.",
  "frontend/src/utils/photoValidation.ts": "Validates uploaded photos by checking file type and size against JPEG/PNG and 6MB limits.",
  "frontend/src/utils/presetTileColors.ts": "Provides deterministic accent color sets for avatar tile presets based on ID.",
  "frontend/src/utils/taskHabits.ts": "Computes on‑time metrics, formats task completion history, and provides helpers for frequency, timestamps, and preference labels/colors.",
  "frontend/src/utils/todoDates.ts": "Functions to compute task due dates, labels, urgency scores, and workday-based scheduling for daily, weekly, and monthly tasks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radii, animations, and shadows with custom design tokens.",
  "project_state.json": "Metadata describing project state, planned features, and requirements for implementing a backend wipe/reset and first-user manager assignment."
}