{
  "backend/main.mo": "Defines user profiles, tasks, audit logs, overtime entries, and comparison helpers for sorting tasks and history.",
  "feature_evidence.json": "Lists two frontend feature changes with affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base/theme configuration defining color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling authentication, profile setup, and routing to role-specific dashboards.",
  "frontend/src/components/AssistantDetailView.tsx": "Displays detailed overtime stats, history, and CSV export for a selected assistant.",
  "frontend/src/components/AssistantList.tsx": "Shows a scrollable list of assistants with overtime totals and selection handling.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, user info, theme toggle, and logout button.",
  "frontend/src/components/ManagerAnalytics.tsx": "Displays overtime totals for assistants and a team bar chart using fetched query data, with loading states and individual summary components.",
  "frontend/src/components/OvertimeChart.tsx": "Renders cumulative overtime as line or bar charts, converting dates and handling loading and empty data states.",
  "frontend/src/components/OvertimeForm.tsx": "Provides a form to submit overtime entries with validation, date conversion, and success/error handling.",
  "frontend/src/components/OvertimeHistory.tsx": "Shows a searchable, paginated table of overtime entries with formatted dates and time breakdowns.",
  "frontend/src/components/OvertimeSummary.tsx": "Displays total overtime in days, hours, and minutes with loading skeletons and simple stat cards.",
  "frontend/src/components/todo/AuditLogView.tsx": "Fetches and filters audit log entries by action and search term, showing a sortable activity table with error handling.",
  "frontend/src/components/todo/EvidenceImagePreviewDialog.tsx": "Displays a dialog showing a full-size preview of an evidence image with a close button.",
  "frontend/src/components/todo/MarkTaskDoneDialog.tsx": "Dialog for marking a task as done, allowing optional comment and image upload with validation and preview.",
  "frontend/src/components/todo/TaskLedgerDialog.tsx": "Shows a task’s audit history in a table with timestamps and action details, including evidence image previews.",
  "frontend/src/components/todo/TaskPreferencesManager.tsx": "Interface for selecting an assistant and managing preference levels for all tasks using backend queries.",
  "frontend/src/components/todo/ToDoSection.tsx": "Main to‑do section handling task creation, editing, completion, filtering, and sorting with multiple dialogs.",
  "frontend/src/components/todo/ToDoTable.tsx": "Renders the task list with edit, completion, pin controls, urgency indicators, and access to history and image previews.",
  "frontend/src/components/todo/ToDoTaskDialog.tsx": "Dialog component for creating or editing to‑do tasks with form state, validation, and submit handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, auto‑refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for user profiles, overtime, assistants, tasks, and management actions.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, color tokens, and global styles for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AssistantDashboard.tsx": "Assistant dashboard page combining to‑do management and overtime tracking with tabs, summaries, forms, and logout handling.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen and triggers Internet Identity authentication with a styled UI and loading state.",
  "frontend/src/pages/ManagerDashboard.tsx": "Renders the manager dashboard with tabs for tasks, team management, analytics, and audit logs, including assistant selection and deletion workflows.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Provides a form for new assistants to create a username and choose a language, submitting registration via a mutation.",
  "frontend/src/utils/todoDates.ts": "Contains helpers for computing task due dates, urgency scoring, and formatting labels based on daily, weekly, or monthly frequencies.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, plugins, and container settings for the project.",
  "project_state.json": "Defines the project’s current app-wide requirements, architectural notes, known issues, and existing feature records for the FitGebit dental-practice app. Captures state for authentication, roles, overtime tracking, a shared to‑do system, and UI/notification behaviors."
}