{
  "kind": "build_request",
  "title": "Promote current draft build to live production deployment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote the currently reviewed draft build to the live/production deployment so end users load this version by default (i.e., the live canister assets and backend match the current draft).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Go live with this version"
        ]
      },
      "acceptanceCriteria": [
        "The live (non-draft) deployment serves the same frontend and backend code as the currently reviewed draft version.",
        "Users who open the app without any preview/draft URL are routed to this promoted version.",
        "No user-facing text is introduced that is not in English as part of the go-live process."
      ]
    },
    {
      "id": "REQ-2",
      "text": "As part of go-live, ensure the deployed UI theme defaults are not in an unintended extra-dim/dark state compared to the version the user just approved.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Go live with this version"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load (new session, no persisted theme), the app does not render with an extra-dim/dark appearance inconsistent with the approved draft.",
        "Theme toggle (if present) continues to work and does not force an unintended default on startup."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any frontend files in immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new application features unrelated to the release promotion.",
    "Changing data schemas or migrating state unless required to successfully deploy the approved draft as live."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}