{
  "kind": "build_request",
  "title": "Fix profile creation so new users can register and access the app",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the authenticated app bootstrap flow so that failures to fetch the caller profile (e.g., authorization/access-control not initialized) do not result in a stuck loading state, and instead show a clear error state with a retry option and a way to re-authenticate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Nothing happens when I create a profile. I can't get in."
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated but `useGetCallerUserProfile()` fails, the UI does not loop indefinitely on \"Loading\" / \"Loading profile...\".",
        "A visible error message is shown in English explaining that the profile could not be loaded, with at least: a \"Retry\" action (refetch) and a \"Sign out\" (or equivalent) action to re-authenticate.",
        "After clicking \"Retry\", the app attempts to refetch the caller profile and proceeds normally if it succeeds.",
        "No changes are made to immutable hook files under `frontend/src/hooks/useInternetIdentity.ts(x)` or `frontend/src/hooks/useActor.ts`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend registration authorization so a first-time Internet Identity user can successfully create a profile via `registerAssistant` and subsequently be authorized for authenticated app calls.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Nothing happens when I create a profile. I can't get in."
        ]
      },
      "acceptanceCriteria": [
        "Calling `registerAssistant` as a newly authenticated principal succeeds without requiring prior `#user` permission (no Unauthorized trap).",
        "After successful registration, subsequent authenticated calls that require `#user` permission succeed for that same principal (i.e., backend grants/initializes required access control state for the caller).",
        "If the caller is anonymous (not authenticated), `registerAssistant` fails with a clear trap message in English indicating authorization is required.",
        "Registration still enforces uniqueness rules (e.g., username not already taken) and returns a clear error message on failure."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust backend caller-profile fetching so the frontend can reliably determine whether a logged-in user has a profile: `getCallerUserProfile` must not trap for first-time authenticated users and should return `null` when no profile exists.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Nothing happens when I create a profile. I can't get in."
        ]
      },
      "acceptanceCriteria": [
        "For an authenticated principal with no stored `UserProfile`, `getCallerUserProfile` returns `null` (does not trap).",
        "For an authenticated principal with a stored `UserProfile`, `getCallerUserProfile` returns that profile.",
        "For an anonymous caller, `getCallerUserProfile` fails in a controlled way (either returns `null` consistently or traps with an English \"Unauthorized\" message), and the frontend handles it without getting stuck."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the profile creation UI provides explicit, user-visible feedback when profile creation fails (including backend trap messages), rather than appearing to do nothing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "Nothing happens when I create a profile. I can't get in."
        ]
      },
      "acceptanceCriteria": [
        "If `registerAssistant` fails, the Profile Setup page shows an explicit error state/message in English (not only a silent failure).",
        "The submit button returns to an enabled state after a failed attempt, allowing the user to try again.",
        "On successful profile creation, the app proceeds into the correct dashboard without requiring a manual refresh."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT, including `frontend/src/hooks/useActor.ts` and `frontend/src/hooks/useInternetIdentity.ts(x)`.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity).",
    "Introducing external databases or additional backend services.",
    "Implementing new product features unrelated to registration/login (e.g., new task/overtime functionality)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}