{
  "kind": "build_request",
  "title": "Reset user profiles and auto-assign first post-reset login as Manager",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend-only administrative operation to remove all previously assigned users by clearing all stored user profiles and any user-linked state that would otherwise become orphaned (e.g., overtime entries keyed by username, notifications keyed by principal, and task preferences keyed by username).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you remove all previously assigned users",
          "Yes and make it so the first user to log in is automatically assigned the manager role."
        ]
      },
      "acceptanceCriteria": [
        "There is a single callable backend method (via Candid/dfx) that clears all user profiles from persistent state.",
        "After the operation completes, fetching the caller profile for any principal returns null until they register/create a profile again.",
        "User-linked collections keyed by principal/username that relate to cleared users are also cleared so they do not reference deleted users."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update backend user registration/profile-creation logic so that after a reset (i.e., when there are zero user profiles), the first user who creates/completes a profile is assigned the Manager role automatically; all subsequent users are assigned the Assistant role by default.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it so the first user to log in is automatically assigned the manager role."
        ]
      },
      "acceptanceCriteria": [
        "When the user profile store is empty, the next successful profile creation results in role = manager for that caller.",
        "When at least one profile exists, any subsequent successful profile creation results in role = assistant for that caller.",
        "The role assignment behavior works correctly immediately after executing the reset operation in REQ-1."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the application currently persists user/profile state across upgrades, add/adjust conditional migration logic to ensure the new reset mechanism and the first-user-manager role assignment remain correct after canister upgrades (no corrupted state; no trapped reads).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister preserves existing state unless the new explicit reset method is invoked.",
        "After an upgrade, calling the reset method still clears user data and the next profile creation still becomes manager as specified."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo; only add backend/migration.mo if state migration is required).",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add a separate 'manager login' mechanism (Internet Identity remains the only authentication).",
    "Do not add a UI button/screen for resetting users unless explicitly requested.",
    "Do not introduce external databases or third-party auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}