{
  "kind": "build_request",
  "title": "Implement backend wipe/reset operation and first-user manager assignment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend-only administrative wipe/reset operation that clears all stored application data and resets all ID counters so the canister returns to a fresh state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "Build the wipe",
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "A new shared backend method exists to perform the wipe/reset and is callable only by an authorized admin (at minimum: an existing manager user).",
        "The wipe/reset clears all in-memory/persisted state for: user profiles, tasks, audit logs, task history, avatars, task preferences, overtime entries, notifications, and any stored blobs tied to profile pictures/avatars/evidence photos (as supported by the blob-storage mixin).",
        "All counters are reset to their initial values (including nextTaskId, nextLogId, nextAvatarId, nextTaskHistoryId).",
        "After wipe/reset completes, querying tasks/audit log/task history returns empty results, and there are zero user profiles stored."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update backend user registration/profile-creation logic so that when there are zero stored user profiles (e.g., immediately after a wipe/reset), the first user who creates/completes a profile is automatically assigned the Manager role; all subsequent users default to Assistant role unless explicitly changed by existing logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Build the wipe"
        ]
      },
      "acceptanceCriteria": [
        "When userProfiles is empty, creating the first profile results in role == #manager for that profile.",
        "When userProfiles is non-empty, creating a new profile results in role == #assistant by default (unless existing code already sets it differently).",
        "Manager-only backend routes continue to enforce manager authorization based on the stored profile role."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure canister upgrades remain safe after adding the wipe/reset mechanism and first-user manager assignment by adding/adjusting conditional migration logic in the backend migration file so upgraded deployments do not trap and state remains consistent.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "A backend migration file exists at backend/migration.mo and compiles with the project.",
        "If any stable state is used/persisted across upgrades, migration handles schema/state changes needed for the wipe/reset and role assignment logic without trapping.",
        "Post-upgrade, existing state (if present) remains readable and the app continues working; wipe/reset can still be invoked and fully clears state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo; use backend/migration.mo only for upgrade handling as needed).",
    "Do not modify any frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add a new frontend UI flow for triggering the wipe/reset unless explicitly requested.",
    "Do not add third-party authentication or external database/storage systems."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}