{
  "kind": "build_request",
  "title": "Fix profile setup so new users can create an account and reach the dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the profile registration flow so a newly authenticated Internet Identity user can successfully create a user profile from the Profile Setup page and then proceed into the app (assistant or manager dashboard as applicable).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can't create new account. I can fill in the name initials and overtime but can't proceed"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity and completing Profile Setup (username, initials, optional overtime, language), clicking “Create Profile” results in the user being routed into the app (not stuck on the Profile Setup page).",
        "If profile creation fails, the UI shows a clear error (toast is acceptable) and the “Create Profile” button becomes clickable again (no permanent pending/disabled state).",
        "The backend registration endpoint used by the frontend (`registerAssistant`) succeeds for a first-time user (no existing `UserProfile`) and persists the created profile so that subsequent calls to `getCallerUserProfile` return a non-null profile for that caller."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend `registerAssistant` call properly authorizes first-time users and initializes all required state so that subsequent authenticated calls function normally.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can't create new account. I can fill in the name initials and overtime but can't proceed"
        ]
      },
      "acceptanceCriteria": [
        "A first-time authenticated caller can call `registerAssistant` without hitting an authorization trap meant for already-registered users.",
        "On successful registration, the caller is granted whatever permission/role is required so that normal app functions that check authorization (e.g., task/overtime APIs) do not immediately trap for the newly registered user.",
        "Registration rejects invalid inputs with explicit errors (e.g., empty username, username too short, initials too long) rather than failing silently."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend registration success handling so that the app immediately reflects the newly created profile (no manual refresh required).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can't create new account. I can fill in the name initials and overtime but can't proceed"
        ]
      },
      "acceptanceCriteria": [
        "After `useRegisterAssistant()` succeeds, the frontend triggers a reliable refresh of the current profile (e.g., refetch or cache update) so `App.tsx` stops rendering `ProfileSetupPage` and renders the correct dashboard.",
        "The user sees a consistent loading state during the transition (no blank screen) and ends up on the dashboard within a short time after success."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only UI components must be composed, not edited).",
    "Do not edit immutable hook files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add `backend/migration.mo` if an existing persisted state schema must change."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity).",
    "Introducing external databases or services.",
    "Adding new product features unrelated to fixing account creation (e.g., new dashboards, new task types)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}