{
  "kind": "build_request",
  "title": "Make user 'Jay' the permanent Manager and default all new users to Assistant",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend user profile creation/registration logic so that the account whose username/user ID equals \"Jay\" is always assigned the Manager role, and every other newly created user profile is assigned the Assistant role by default.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I just want my account to be the manager and any new accounts to be assistants.",
          "Jay is my user ID"
        ]
      },
      "acceptanceCriteria": [
        "When a new profile is created/registered with username \"Jay\", the stored role is Manager.",
        "When a new profile is created/registered with any username other than \"Jay\", the stored role is Assistant.",
        "If a profile already exists for username \"Jay\", it remains (or is corrected to) Manager on subsequent calls without creating duplicates.",
        "Role assignment happens automatically during profile creation without any additional UI steps."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend onboarding copy reflects the new role assignment rule: \"Jay\" is the Manager account, and all other new accounts will be Assistants by default.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Jay is my user ID",
          "I just want my account to be the manager and any new accounts to be assistants."
        ]
      },
      "acceptanceCriteria": [
        "Profile setup page no longer claims \"the first account\" becomes Manager; instead it states that the \"Jay\" account will be Manager and all others will be Assistants.",
        "All user-facing text for this change is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing a UI to change managers or promote/demote users.",
    "Adding third-party authentication beyond Internet Identity.",
    "Adding external database/storage systems beyond the current canister state and existing blob storage mixin."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}