{
  "kind": "build_request",
  "title": "Fix dark mode (system theme) and set Dutch as default profile language",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Fix dark mode so it applies across the entire app and works in both preview and live versions by enabling system/device theme detection and ensuring the theme toggle actually changes the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-7",
          "msg-12"
        ],
        "quotes": [
          "The dark mode isn't working",
          "It should follow the device",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "On first load in a fresh browser session (no prior theme saved), the app theme matches the OS/system preference (light/dark).",
        "Using the header theme dropdown (Light/Dark/System) immediately updates the UI colors across all screens (login, profile setup, assistant dashboard, manager dashboard, to-do).",
        "Selecting \"System\" makes the app follow OS changes (e.g., switching OS light->dark updates the app without requiring a reload).",
        "Theme choice persists across reloads for that user in the same browser (per next-themes default behavior)."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Set Dutch as the default language for new users during profile setup while still allowing users to manually change the language selection before creating their profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11",
          "msg-13",
          "msg-15"
        ],
        "quotes": [
          "Fix it please and make Dutch the standard language",
          "I would like Dutch to be default language",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "On the Profile Setup page, the \"Preferred Language\" field defaults to Dutch for a new user who has not interacted with the language selector.",
        "The user can change the language to English or French and successfully create a profile with the selected language stored.",
        "No other existing language selection functionality is removed or restricted."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Keep all user-facing text in English (labels, buttons, toasts, and error messages) in the implementation.",
    "Do not introduce WebSockets or external services; use existing libraries already in the project (e.g., next-themes already referenced by the header)."
  ],
  "nonGoals": [
    "Do not implement automatic translation of existing tasks or UI text when switching languages (only set Dutch as the default selection for new profiles).",
    "Do not redesign the app UI beyond what is necessary to make dark mode function correctly."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}