{
  "kind": "build_request",
  "title": "Fix Sign In button doing nothing by surfacing Internet Identity login errors and initialization state",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Login page so that clicking “Sign in” always results in visible feedback: either Internet Identity login starts (status changes to “Signing in…”) or an actionable error message is shown when Internet Identity cannot start (e.g., AuthClient not initialized yet or login popup blocked).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Nothing happens when I click on sign in"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the Sign in button, the UI changes immediately (spinner/disabled state) OR displays an error message within the existing Alert component.",
        "If Internet Identity login cannot start because the AuthClient is not initialized yet (useInternetIdentity sets a loginError like “AuthClient is not initialized yet…”), the Login page displays that error to the user instead of appearing to do nothing.",
        "If the Internet Identity provider reports a login error (loginStatus === 'loginError' and/or loginError is set in the Internet Identity context), the Login page shows a user-friendly message using the existing getUserFacingErrorMessage() mapping.",
        "The page does not rely on try/catch around `await login()` to detect failures, since `login()` in the Internet Identity hook is synchronous and signals failures via context state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent silent no-op clicks by disabling the Login page Sign in button while Internet Identity is initializing, and show clear user-facing text explaining that authentication is still initializing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Nothing happens when I click on sign in"
        ]
      },
      "acceptanceCriteria": [
        "While `loginStatus === 'initializing'`, the Sign in button is disabled and shows an initializing label (e.g., “Initializing…”).",
        "Once initialization completes (`loginStatus` becomes 'idle'), the Sign in button becomes enabled and behaves normally.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui.",
    "Keep the backend unchanged; this fix should be achievable by frontend state/UX handling."
  ],
  "nonGoals": [
    "Changing the Internet Identity hook API (e.g., making login() return a Promise) since the hook file is immutable.",
    "Adding new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}