{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unstick authenticated bootstrap + show clear registration errors for first-time users",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a clear error state (with retry + sign out) when authenticated profile fetch fails, instead of an infinite loading screen.",
      "acceptanceCriteria": [
        "When a user is authenticated but `useGetCallerUserProfile()` fails, the UI does not loop indefinitely on \"Loading\" / \"Loading profile...\".",
        "A visible error message is shown in English explaining that the profile could not be loaded, with at least: a \"Retry\" action (refetch) and a \"Sign out\" (or equivalent) action to re-authenticate.",
        "After clicking \"Retry\", the app attempts to refetch the caller profile and proceeds normally if it succeeds.",
        "No changes are made to immutable hook files under `frontend/src/hooks/useInternetIdentity.ts(x)` or `frontend/src/hooks/useActor.ts`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthBootstrapErrorScreen.tsx",
          "operation": "create",
          "description": "Create an authenticated-bootstrap error screen that explains (in English) the caller profile could not be loaded, and provides actions for Retry (calls a provided refetch callback) and Sign out (calls a provided re-auth callback). Use the selected `authorization` component guidance for handling authorization/trap errors and re-auth flows; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/userFacingError.ts",
          "operation": "create",
          "description": "Add a small utility to map thrown errors (including backend trap messages such as \"Unauthorized\") into stable, user-facing English messages suitable for bootstrap and registration UIs."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the authenticated app bootstrap flow to handle `useGetCallerUserProfile()` errors: render `AuthBootstrapErrorScreen` when the profile query is in an error state (instead of showing \"Loading\" / \"Loading profile...\" forever), wire Retry to the query's `refetch()`, and wire Sign out to `useInternetIdentity().clear()` plus clearing React Query cached data. Use the selected `authorization` component guidance for clearing cached application data on logout; verify the component's usage instructions before implementing. Do not modify immutable hook files."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide explicit, persistent, user-visible error feedback on profile creation failure and ensure successful registration transitions into the dashboard without refresh.",
      "acceptanceCriteria": [
        "If `registerAssistant` fails, the Profile Setup page shows an explicit error state/message in English (not only a silent failure).",
        "The submit button returns to an enabled state after a failed attempt, allowing the user to try again.",
        "On successful profile creation, the app proceeds into the correct dashboard without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileSetupPage.tsx",
          "operation": "modify",
          "description": "Add an explicit on-page error state (e.g., a destructive Alert area) that becomes visible when `registerAssistant` fails, including backend trap messages when safe to show, using the shared error-to-message utility. Ensure the error state clears on new attempts/success. Keep the submit button enabled after failures by relying on mutation state and not leaving the form stuck. Continue to rely on the existing registration mutation refetch/invalidation so that, on success, App transitions into the correct dashboard without manual refresh. Use the selected `authorization` component guidance for graceful handling of authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the `useRegisterAssistant` mutation error propagation so that failures return actionable messages to the UI (preserving backend trap message text when present), and ensure the existing post-success invalidation/refetch of `currentUserProfile` remains in place to trigger the dashboard transition."
        }
      ]
    }
  ]
}