{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Login UX: show Internet Identity initialization and login errors on Sign in",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Sign in click always produces immediate visible feedback and surfaces Internet Identity login errors via existing Alert + getUserFacingErrorMessage().",
      "acceptanceCriteria": [
        "When the user clicks the Sign in button, the UI changes immediately (spinner/disabled state) OR displays an error message within the existing Alert component.",
        "If Internet Identity login cannot start because the AuthClient is not initialized yet (useInternetIdentity sets a loginError like “AuthClient is not initialized yet…”), the Login page displays that error to the user instead of appearing to do nothing.",
        "If the Internet Identity provider reports a login error (loginStatus === 'loginError' and/or loginError is set in the Internet Identity context), the Login page shows a user-friendly message using the existing getUserFacingErrorMessage() mapping.",
        "The page does not rely on try/catch around `await login()` to detect failures, since `login()` in the Internet Identity hook is synchronous and signals failures via context state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Remove try/catch + awaiting around Internet Identity login() and instead rely on Internet Identity context state (loginStatus/loginError) to drive UI feedback. On Sign in click: clear local/gate errors, persist role/token as before, call login() synchronously, and immediately reflect state via button disabled/spinner/label. Add a small effect that listens for context loginStatus === 'loginError' and maps context loginError through getUserFacingErrorMessage() into the existing Alert so AuthClient-not-initialized and popup/provider failures are visible."
        },
        {
          "path": "frontend/src/utils/userFacingError.ts",
          "operation": "modify",
          "description": "Extend getUserFacingErrorMessage() mappings to cover common Internet Identity/login popup failure strings (e.g., popup blocked, window closed, initialization/login failed) so Login page can show actionable, user-friendly guidance when loginStatus is 'loginError' and/or loginError is set."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Disable Sign in while Internet Identity is initializing and display clear English text indicating authentication is still initializing.",
      "acceptanceCriteria": [
        "While `loginStatus === 'initializing'`, the Sign in button is disabled and shows an initializing label (e.g., “Initializing…”).",
        "Once initialization completes (`loginStatus` becomes 'idle'), the Sign in button becomes enabled and behaves normally.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Wire initializing UX to Internet Identity context: treat loginStatus === 'initializing' as a disabled state for the Sign in button with an \"Initializing...\" label (and optional spinner). Add concise English helper text near the button (or within an Alert) explaining that authentication is still initializing and the user should wait, preventing silent no-op clicks."
        }
      ]
    }
  ]
}