{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project experiencing login flow stuck on loading; user requested a full backend state reset and scrubbing all existing user accounts to restart with fresh logins.",
  "architectural_notes": [
    "Support administrative full backend state reset (including user account data) to reinitialize login system."
  ],
  "known_issues": [
    "Login page stuck on loading; unable to get past login screen."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-add-a-frontend-full-system-reset-entry-point-that-lets-an-admin-trigger-the-backend-full-reset-including-a-strong-confirmation-step-and-clear-success-error-feedback-in-english",
      "title": "Add a frontend “Full System Reset” entry point that lets an admin trigger the backend full reset, including a strong confirmation step and clear success/error feedback in English.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-after-performing-a-full-system-reset-verify-and-adjust-the-auth-bootstrap-flow-so-a-user-can-sign-in-with-internet-identity-and-be-routed-to-profile-setup-because-no-user-profile-exists-rather-than-being-stuck-on-an-indefinite-loading-screen",
      "title": "After performing a full system reset, verify and adjust the auth bootstrap flow so a user can sign in with Internet Identity and be routed to Profile Setup (because no user profile exists) rather than being stuck on an indefinite loading screen.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Full backend state reset and scrub all existing user accounts; restart with fresh logins",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a backend admin-only method to fully reset application state (scrub all previous users and all related data), so the app can be restarted with fresh logins.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure the full reset also clears access-control/authorization state so that previously authorized principals are no longer authorized after the reset.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add full system reset to scrub all users and restart fresh logins",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}